Revit 2027 API
BuiltInFailures.RebarFailures.RebarContainerOutSideOfHostWarning Property
 Rebar Container is placed completely outside of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarContainerOutSideOfHostWarning { get; }
Public Shared ReadOnly Property RebarContainerOutSideOfHostWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarContainerOutSideOfHostWarning {
	FailureDefinitionId^ get ();
}
static member RebarContainerOutSideOfHostWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace